package com.lyy._05IO流;

/**
 * IO 流读写数据
 * input输入流
 * output 输出流
 * <p>
 * 引入 File类智能操作文件对象本身,不能读写文本对象本身的内容
 * 读写数据内容,需要用到IO流
 * IO流是一个水流模型 IO理解成水管,把数据理解成水流
 * <p>
 * IO流的分类
 * 按照流的方向  分为 输入流 输出流
 * （1）输出流：以内存为基准，把内存中的数据写出到磁盘文件或者网络介质中去的流称为输出流。
 * 输出流的作用：写数据到文件，或者写数据发送给别人。
 * <p>
 * （2）输入流：以内存为基准，把磁盘文件中的数据或者网络中的数据读入到内存中去的流称为输入流。
 * 输入流的作用：读取数据到内存。
 * <p>
 * 输入  获取数据到内存  输出 从内存取数据
 * <p>
 * 按照流的内容分为  字节流 字符流
 * 字节输入流 以内存为基准，把磁盘文件中的数据或者网络中的数据以一个一个的字节的形式读入到内存中去的流称为字节输入流。
 * 字节输出流  以一个一个的字节的形式从内存中读出
 * 字符输入流  以一个一个的字符的形式读入到内存中
 * 字符输出流  以一个一个的字节的形式从内存中读出
 */


public class io_demo {
    public static void main(String[] args) {

    }
}
